/*
Обхождане на текста и сравняване с dataset от JSON файл(ове) с ~100 езика, като за всеки са сложени top 100-250-500-1000 думи (взети от frequency lists), НО с всичките словоформи (парадигма) за всяка дума... И при засичане на над 3–10 думи от >=2 езика, изписване на 'Mixed: {lang1}, {lang2}...'.*

Optional: substring search & regex(p) search...

* Уточнение: Поради наличие на интернационализми (от латински, английски, френски, немски и т.н.) в много езици... е възможно да се изпише наличие на 2+ езика дори да е 1 език, защото са едни и същи думи и то с еднакъв правопис в няколко езика ((х)омоними + (х)омографи), даже и със същото значение. Интервали и пунктуация като разделители (понякога не „хваща“ правилно поради пунктуационни идиосинкразии).
Не се отчитат обаче 1337 (l33t/chatspeak) и „зъ е'ин прЕател“ плюс неграмотно написани думи (т.е. със сгрешен правопис), т.е. 80% от българите, които не покриват 75% от изследването PISA... ://
*/
