/**
* Языковой файл JS: Русский
*/

var message_pop_up_lang =
{
	// СТАНДАРТНЫЕ
	'error'			   : 'Найдены ошибки',
	'no_permission'	   : 'У вас нет прав для выполнения этого действия',
	'cannot_cont'	   : 'Невозможно продолжить',
	'settings_updated' : 'Настройки обновлены',
	
	// Дополнительные ошибки:
	'pp_date_error'     : 'Вы должны указать полную дату рождения',
	'pp_comment_error'  : 'Вы не можете публиковать пустые комментарии',
	'pp_friend_exist'   : 'Указанный пользователь не существует',
	'pp_friend_already' : 'Этот пользователь уже находится в вашем списке друзей',
	'pp_friend_removed' : 'Друг удален',
	'pp_icq_error'      : 'Номер ICQ должен содержать только цифры',
	
	// Добавление друзей:
	'pp_friend_added'     : 'Этот пользователь был добавлен в ваш список друзей!',
	'pp_friend_added_mod' : 'Ваш друг должен одобрить ваш запрос',
	'pp_friend_approved'  : 'Запрос одобрен',
	
	// Обновление комментариев
	'pp_comments_updated'  : 'Комментарии обновлены',
	'pp_comment_added_mod' : "Комментарии должны быть подтверждены перед выводом",
	
	// Модуль опроса
	'already_voted' : 'Вы уже проголосовали',
	
	// Модуль записей
	'rating_updated' : 'Ваш рейтинг обновлен',
	'rating_added'   : 'Ваш рейтинг добавлен',
	'rating_already' : 'Вы уже проголосовали за эту запись'
};

/**
* Global stuff
*/

var ipb_global_lang =
{
	// 2.3.2
	'action_cancelled'	  	  : 'Действие отменено!',
	// ОШИБКА
	'post_upload_not_empty'   : 'У вас есть элемент для загрузки. Нажмите «ЗАГРУЗИТЬ» для загрузки или «OK» для продолжения без загрузки файла.',
	// РЕДАКТОРЫ
	'editor_enter_url'		  : 'Пожалуйста, введите полный URL адрес',
	'editor_enter_title'      : 'Пожалуйста, введите заголовок для этого пункта',
	'editor_enter_email'      : 'Пожалуйста, введите e-mail адрес',
	'editor_enter_image'      : 'Пожалуйста, введите URL адрес для этого изображения',
	'editor_enter_list'       : 'Введите пункт списка',
	// ОСНОВНОЕ
	'general_error'           : 'Ошибка',
	'general_ok'              : 'OK',
	'image_resized'           : 'Уменьшено: <%1>% от [ <%2> на <%3> ] — нажмите для просмотра полного изображения',
	'image_attach_percent'    : 'Уменьшено на <%1>%',
	'image_attach_no_percent' : 'Изображение уменьшено',
	'image_attach_dims'       : '<%1> x <%2>',
	'image_attach_size'       : ' (<%1>)',
	'click_to_view'           : 'Нажмите для просмотра полного изображения',
	'view_full_size'          : 'Просмотр полного размера изображения',
	'visit_my_website'		  : 'Посетить мою домашнюю страницу'
};